HexSense-MIT/firmware/STM32F722/DW3000/DW3000_op/DW3000_op/Core/Inc/DW3000_FZ.h
/*
 * DW3000_FZ.h
 *
 *  Created on: Jul 16, 2025
 *      Author: liufangzheng
 */

#ifndef INC_DW3000_FZ_H_
#define INC_DW3000_FZ_H_

#include <assert.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include <string.h>

#include "stm32f7xx_hal.h"
#include "main.h"

#include "dw3000_deca_regs.h"
#include "dw3000_deca_vals.h"
#include "HS_system.h"

extern bool DW3000_IRQ_flag; // flag to indicate if the TX is done

typedef enum {
  tx_node = 0, //!< TX node
  rx_node = 1  //!< RX node
} node_type;

// FZ stole from DecaWave API
typedef enum {
  DWT_DW3000_DEV_ID       = (int)(0xDECA0302), //!< DW3000 (non PDOA) silicon device ID
  DWT_QM33110_DEV_ID      = (int)(0xDECA0304), //!< QM33110 (non PDOA) silicon device ID
  DWT_DW3000_PDOA_DEV_ID  = (int)(0xDECA0312), //!< DW3000 (with PDOA) silicon device ID
  DWT_QM33120_PDOA_DEV_ID = (int)(0xDECA0314) //!< QM33120 (with PDOA) silicon device ID
} dw_chip_id_e;

typedef enum {
  GPIO0 = 0x1,
  GPIO1 = 0x1 << 1,
  GPIO2 = 0x1 << 2,
  GPIO3 = 0x1 << 3,
  GPIO4 = 0x1 << 4,
  GPIO5 = 0x1 << 5,
  GPIO6 = 0x1 << 6,
  GPIO7 = 0x1 << 7,
  GPIO8 = 0x1 << 8
} dw_gpio;

typedef enum {
  OUTPUT_MODE = 0, //!< GPIO output mode
  INPUT_MODE  = 1  //!< GPIO input mode
} dw_gpio_mode;

typedef enum {
  CH5 = 0, //!< GPIO output mode
  CH9  = 1  //!< GPIO input mode
} channel;

#define GEN_CFG_AES_base 0x00
#define DIG_DIAG_base    0x0F

unsigned int countBits(unsigned int number);

HAL_StatusTypeDef sendBytes(uint8_t *sendb, uint16_t sendLen);
HAL_StatusTypeDef readBytes(uint8_t *recvb, uint16_t recLen);

uint32_t readOrWriteFullAddress(uint32_t base, uint32_t sub, uint32_t data, uint32_t dataLen, uint32_t readWriteBit);

uint32_t read(int base, int sub);

extern void set_SPI2lowspeed(SPI_HandleTypeDef *hspi);
extern void set_SPI2highspeed(SPI_HandleTypeDef *hspi);

extern uint8_t DW3000pack_fast_command(uint8_t cmd);

extern uint8_t DW3000pack_short_address(uint8_t address, uint8_t rw);
extern uint16_t DW3000pack_full_address(uint8_t base, uint8_t sub, uint8_t rw);

extern void DW3000poweron(void);
extern void DW3000init(SPI_HandleTypeDef *hspi);
extern void DW3000softReset(void);
extern void DW3000hardReset(void);

extern void     DW3000writereg(uint32_t reg, uint8_t* data, uint8_t len);
extern uint32_t DW3000readreg(uint32_t reg, uint8_t len);

extern void DW3000enter_IDLE_PLL(void);

extern uint8_t DW3000check_IDLE_RC(void);
extern uint8_t DW3000check_IDLE_PLL(void);
extern uint8_t DW3000check_IDLE(void);

extern void DW3000config_CH(uint16_t RX_PCODE, uint16_t TX_PCODE, uint8_t SFD_TYP, channel CH);
extern void DW3000set_TXLED(void);

extern uint32_t DW3000readOTP(uint8_t addr);

extern void DW3000_clear_IRQ(void);
extern void DW3000_clear_all_events(void);

extern void DW3000_writefastCMD_FZ(uint8_t cmd);
extern void DW3000_irq_for_tx_done(void);
extern void DW3000_irq_for_rx_done(void);

extern void DW3000_disable_RX_timeout(void);
extern void DW3000_set_max_sfd_timeout(void);

extern void DW3000_debug_reg(uint32_t reg, uint8_t len);

extern void DW3000_cfg_FZ(void); // all configuration for RX
extern void DW3000_pgf_cal(void);



// ----------------------------------- FZ: stole from DecaWave API (Jul 18, 2025) -----------------------------------
/* */
#define DWT_SUCCESS (0)
#define DWT_ERROR   (-1)

//! constants for specifying TX Preamble length in symbols
//! These are defined to allow them be directly written into byte 2 of the TX_FCTRL register
//! (i.e. a four bit value destined for bits 20..18 but shifted left by 2 for byte alignment)
#define DWT_PLEN_4096   0x03    //! Standard preamble length 4096 symbols
#define DWT_PLEN_2048   0x0A    //! Non-standard preamble length 2048 symbols
#define DWT_PLEN_1536   0x06    //! Non-standard preamble length 1536 symbols
#define DWT_PLEN_1024   0x02    //! Standard preamble length 1024 symbols
#define DWT_PLEN_512    0x0d    //! Non-standard preamble length 512 symbols
#define DWT_PLEN_256    0x09    //! Non-standard preamble length 256 symbols
#define DWT_PLEN_128    0x05    //! Non-standard preamble length 128 symbols
#define DWT_PLEN_64     0x01    //! Standard preamble length 64 symbols
#define DWT_PLEN_32     0x04    //! Non-standard length 32
#define DWT_PLEN_72     0x07    //! Non-standard length 72

//! constants for specifying Preamble Acquisition Chunk (PAC) Size in symbols
#define DWT_PAC8        0   //!< PAC  8 (recommended for RX of preamble length  128 and below
#define DWT_PAC16       1   //!< PAC 16 (recommended for RX of preamble length  256
#define DWT_PAC32       2   //!< PAC 32 (recommended for RX of preamble length  512
#define DWT_PAC4        3   //!< PAC  4 (recommended for RX of preamble length  < 127

//! constants for selecting the bit rate for data TX (and RX)
//! These are defined for write (with just a shift) the TX_FCTRL register
#define DWT_BR_850K     0   //!< UWB bit rate 850 kbits/s
#define DWT_BR_6M8      1   //!< UWB bit rate 6.8 Mbits/s
#define DWT_BR_NODATA   2   //!< No data (SP3 packet format)

#define DWT_PHRMODE_STD      0x0     // standard PHR mode
#define DWT_PHRMODE_EXT      0x1     // DW proprietary extended frames PHR mode

#define DWT_PHRRATE_STD      0x0     // standard PHR rate
#define DWT_PHRRATE_DTA      0x1     // PHR at data rate (6M81)

// Defined constants for "mode" bit field parameter passed to dwt_setleds() function.
#define DWT_LEDS_DISABLE     0x00
#define DWT_LEDS_ENABLE      0x01
#define DWT_LEDS_INIT_BLINK  0x02

// Define DW3000 STS modes
#define DWT_STS_MODE_OFF         0x0     // STS is off
#define DWT_STS_MODE_1           0x1     // STS mode 1
#define DWT_STS_MODE_2           0x2     // STS mode 2
#define DWT_STS_MODE_ND          0x3     // STS with no data
#define DWT_STS_MODE_SDC         0x8     // Enable Super Deterministic Codes
#define DWT_STS_CONFIG_MASK      0xB

// Define DW3000 PDOA modes
#define DWT_PDOA_M0           0x0     // DW PDOA mode is off
#define DWT_PDOA_M1           0x1     // DW PDOA mode  mode 1
#define DWT_PDOA_M3           0x3     // DW PDOA mode  mode 3

/*This Enum holds the index for factor calculation.*/
typedef enum
{
    DWT_STS_LEN_32  =0,
    DWT_STS_LEN_64  =1,
    DWT_STS_LEN_128 =2,
    DWT_STS_LEN_256 =3,
    DWT_STS_LEN_512 =4,
    DWT_STS_LEN_1024=5,
    DWT_STS_LEN_2048=6
} dwt_sts_lengths_e;

